src/InformationRegisters/ПроведенныеШтрихкодыКонтроляОтбора/ПроведенныеШтрихкодыКонтроляОтбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроведенныеШтрихкодыКонтроляОтбора</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Задание</name>
    <type>
      <types>DocumentRef.Задание</types>
    </type>
  </resources>
  <resources>
    <name>НомерЗаданияНаОтбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комплектовщик</name>
    <type>
      <types>CatalogRef.Комплектовщики</types>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПроведенныеШтрихкодыКонтроляОтбора/ManagerModule.bsl
// @strict-types
#Область ПрограммныйИнтерфейс

// Функция проверяет, что запись со штрихкодом отсутсвует в регистре сведений.
// 
// Параметры:
//  Штрихкод - Строка
// 
// Возвращаемое значение:
//  Булево - Истина, если запись со штрихкодом найдена
Функция ШтриходУжеПроведен(Знач Штрихкод) Экспорт

    Запрос = Новый Запрос("ВЫБРАТЬ
                          |    КОЛИЧЕСТВО(*) КАК Количество
                          |ИЗ
                          |    РегистрСведений.ПроведенныеШтрихкодыКонтроляОтбора КАК ПроведенныеШтрихкодыКонтроляОтбора
                          |ГДЕ
                          |    ПроведенныеШтрихкодыКонтроляОтбора.Штрихкод = &Штрихкод");

    Запрос.УстановитьПараметр("Штрихкод", Штрихкод);

    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
    Выборка.Следующий();
    
    //@skip-check property-return-type
    Количество = Выборка.Количество; // Число

    Возврат Количество <> 0;

КонецФункции

// Функция производит поиск по штрихкоду.
// 
// Параметры:
//  Штрихкод - Строка
// 
// Возвращаемое значение:
// Неопределено, Структура - Результат поиска:
// * Дата - Дата
// * Задание - ДокументСсылка.Задание
// * НомерЗаданияНаОтбор - Число
// * Комлпектовщик - СправочникСсылка.Комплектовщики
Функция НайтиПоШтрихкоду(Знач Штрихкод) Экспорт

    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |    ПроведенныеШтрихкодыКонтроляОтбора.Штрихкод,
                   |    ПроведенныеШтрихкодыКонтроляОтбора.Дата,
                   |    ПроведенныеШтрихкодыКонтроляОтбора.Задание,
                   |    ПроведенныеШтрихкодыКонтроляОтбора.НомерЗаданияНаОтбор,
                   |    ПроведенныеШтрихкодыКонтроляОтбора.Комлпектовщик
                   |ИЗ
                   |    РегистрСведений.ПроведенныеШтрихкодыКонтроляОтбора КАК ПроведенныеШтрихкодыКонтроляОтбора
                   |ГДЕ
                   |    ПроведенныеШтрихкодыКонтроляОтбора.Штрихкод = &Штрихкод";

    Запрос.УстановитьПараметр("Штрихкод", Штрихкод);

    РезультатЗапроса = Запрос.Выполнить();

    Выборка = РезультатЗапроса.Выбрать();

    Если Выборка.Следующий() Тогда

        //@skip-check property-return-type
        Дата = Выборка.Дата; // Дата
        //@skip-check property-return-type
        Задание = Выборка.Задание; // ДокументСсылка.Задание
        //@skip-check property-return-type
        НомерЗаданияНаОтбор = Выборка.НомерЗаданияНаОтбор; // Число
        //@skip-check property-return-type
        Комлпектовщик = Выборка.Комлпектовщик; // СправочникСсылка.Комплектовщики

        Результат = Новый Структура;

        Результат.Вставить("Дата", Дата);
        Результат.Вставить("Задание", Задание);
        Результат.Вставить("НомерЗаданияНаОтбор", НомерЗаданияНаОтбор);
        Результат.Вставить("Комлпектовщик", Комлпектовщик);

        Возврат Результат;

    Иначе

        Возврат Неопределено;

    КонецЕсли;

КонецФункции

// Процедура проверяет, что в регистре нет записи с переданным штрихкодом
// и добавляет новую запись.
// 
// Параметры:
//  Штрихкод - Строка
//  Задание - ДокументСсылка.Задание
//  НомерЗаданияНаОтбор - Число
//  Комплектовщик - СправочникСсылка.Комплектовщики
//
// Возвращаемое значение:
//  Булево - Истина, если запись со штрихкодом добавлена
Функция ПровестиШтрихкод(Знач Штрихкод, Знач Задание, Знач НомерЗаданияНаОтбор, Знач Комплектовщик) Экспорт

    Если ШтриходУжеПроведен(Штрихкод) Тогда

        Возврат Ложь;

    КонецЕсли;

    Запись = СоздатьМенеджерЗаписи();

    Запись.Штрихкод = Штрихкод;
    Запись.Дата = ТекущаяДатаСеанса();
    Запись.Задание = Задание;
    Запись.НомерЗаданияНаОтбор = НомерЗаданияНаОтбор;
    Запись.Комплектовщик = Комплектовщик;

    Запись.Записать();

    Возврат Истина;

КонецФункции

#КонецОбласти
